package task_second.start_version;

public class Mistakes {
//    Ошибки в исходном коде:
//    Класс Engine не был объявлен в исходном коде
//    используется геттер на паблик поле Car:11
//    используется сеттер на паблик поле Car:14
//    В абстрактном класс заданы и цвет машины и название, хотя реализации совсем разные. Создана слишком большая связность
//    Класс Lorry не реализовал метод open, хотя наследуется от абстрактного класса
//    Класс LightWeightCar не имплементирует stopable. Автомобиль не умеет останавливаться?
//    метод open в абстрактоном классе без модификатора доступа!
//    метод open в классе Lorry без модификатора доступа!
//    Поля color и name в асбтрактном классе приватные, хотя они будут использованы потомками!
}
